Tekla.Structures.ModuleManager
The ModuleManager class handles the product model module configuration information: the
information that defines what configuration the customer is currently running.

Tekla.Structures.ModuleManager.events
The events

Tekla.Structures.ModuleManager.configuration
Configuration info

Tekla.Structures.ModuleManager.multimaterialModeling
"MM"

Tekla.Structures.ModuleManager.loadModeling
"LM"

Tekla.Structures.ModuleManager.steelDetailing
"SD"

Tekla.Structures.ModuleManager.concreteDetailing
"CD"

Tekla.Structures.ModuleManager.rebarModeling
"RM"

Tekla.Structures.ModuleManager.taskManagement
"TM"

Tekla.Structures.ModuleManager.analysisAndDesign
"AD"

Tekla.Structures.ModuleManager.Configuration
The currently running configuration of Tekla Structures.

Tekla.Structures.ModuleManager.MultimaterialModeling
Indicates whether the multimaterial modeling is enabled.

Tekla.Structures.ModuleManager.LoadModeling
Indicates whether the load modeling is enabled.

Tekla.Structures.ModuleManager.SteelDetailing
Indicates whether the steel detailing is enabled.

Tekla.Structures.ModuleManager.ConcreteDetailing
Indicates whether the concrete detailing is enabled.

Tekla.Structures.ModuleManager.RebarModeling
Indicates whether the rebar modeling is enabled.

Tekla.Structures.ModuleManager.AnalysisAndDesign
Indicates whether the Analysis and Design management is enabled.

Tekla.Structures.ModuleManager.TaskManagement
Indicates whether the task management is enabled.

Tekla.Structures.ModuleManager.#cctor
Initializes currently available modules.

Tekla.Structures.ModuleManager.OnModuleManagerUpdate
Module manager update event.

Tekla.Structures.ModuleManager.GetModules
Must be called once.
Returns: true